Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/pio/sam9x60.h
/* ========== PIO definition for ADC peripheral ========== */
#define PIN_PB18B_ADC_ADTRG                        _L_(50)      /**< ADC signal: ADC_ADTRG on PB18 mux B */
#define MUX_PB18B_ADC_ADTRG                        _L_(1)       /**< ADC signal line function value: ADC_ADTRG */
#define PIO_PB18B_ADC_ADTRG                        _UL_(1 << 18) /**< ADC signal: ADC_ADTRG */
#define PIN_PB11X1_ADC_AD0                         _L_(43)      /**< ADC signal: ADC_AD0 on PB11 mux X1 */
#define PIO_PB11X1_ADC_AD0                         _UL_(1 << 11) /**< ADC signal: ADC_AD0 */
#define PIN_PB12X1_ADC_AD1                         _L_(44)      /**< ADC signal: ADC_AD1 on PB12 mux X1 */
#define PIO_PB12X1_ADC_AD1                         _UL_(1 << 12) /**< ADC signal: ADC_AD1 */
#define PIN_PB13X1_ADC_AD2                         _L_(45)      /**< ADC signal: ADC_AD2 on PB13 mux X1 */
#define PIO_PB13X1_ADC_AD2                         _UL_(1 << 13) /**< ADC signal: ADC_AD2 */
#define PIN_PB14X1_ADC_AD3                         _L_(46)      /**< ADC signal: ADC_AD3 on PB14 mux X1 */
#define PIO_PB14X1_ADC_AD3                         _UL_(1 << 14) /**< ADC signal: ADC_AD3 */
#define PIN_PB15X1_ADC_AD4                         _L_(47)      /**< ADC signal: ADC_AD4 on PB15 mux X1 */
#define PIO_PB15X1_ADC_AD4                         _UL_(1 << 15) /**< ADC signal: ADC_AD4 */
#define PIN_PB16X1_ADC_AD5                         _L_(48)      /**< ADC signal: ADC_AD5 on PB16 mux X1 */
#define PIO_PB16X1_ADC_AD5                         _UL_(1 << 16) /**< ADC signal: ADC_AD5 */
#define PIN_PB17X1_ADC_AD6                         _L_(49)      /**< ADC signal: ADC_AD6 on PB17 mux X1 */
#define PIO_PB17X1_ADC_AD6                         _UL_(1 << 17) /**< ADC signal: ADC_AD6 */
#define PIN_PB6X1_ADC_AD7                          _L_(38)      /**< ADC signal: ADC_AD7 on PB6 mux X1 */
#define PIO_PB6X1_ADC_AD7                          _UL_(1 << 6) /**< ADC signal: ADC_AD7 */
#define PIN_PB7X1_ADC_AD8                          _L_(39)      /**< ADC signal: ADC_AD8 on PB7 mux X1 */
#define PIO_PB7X1_ADC_AD8                          _UL_(1 << 7) /**< ADC signal: ADC_AD8 */
#define PIN_PB8X1_ADC_AD9                          _L_(40)      /**< ADC signal: ADC_AD9 on PB8 mux X1 */
#define PIO_PB8X1_ADC_AD9                          _UL_(1 << 8) /**< ADC signal: ADC_AD9 */
#define PIN_PB9X1_ADC_AD10                         _L_(41)      /**< ADC signal: ADC_AD10 on PB9 mux X1 */
#define PIO_PB9X1_ADC_AD10                         _UL_(1 << 9) /**< ADC signal: ADC_AD10 */
#define PIN_PB10X1_ADC_AD11                        _L_(42)      /**< ADC signal: ADC_AD11 on PB10 mux X1 */
#define PIO_PB10X1_ADC_AD11                        _UL_(1 << 10) /**< ADC signal: ADC_AD11 */
/* ========== PIO definition for AIC peripheral ========== */
#define PIN_PC31A_AIC_FIQ                          _L_(89)      /**< AIC signal: AIC_FIQ on PC31 mux A */
#define MUX_PC31A_AIC_FIQ                          _L_(0)       /**< AIC signal line function value: AIC_FIQ */
#define PIO_PC31A_AIC_FIQ                          _UL_(1 << 25) /**< AIC signal: AIC_FIQ */
#define PIN_PB18A_AIC_IRQ                          _L_(50)      /**< AIC signal: AIC_IRQ on PB18 mux A */
#define MUX_PB18A_AIC_IRQ                          _L_(0)       /**< AIC signal line function value: AIC_IRQ */
#define PIO_PB18A_AIC_IRQ                          _UL_(1 << 18) /**< AIC signal: AIC_IRQ */
/* ========== PIO definition for CAN0 peripheral ========== */
#define PIN_PA9B_CAN0_CANRX0                       _L_(9)       /**< CAN0 signal: CAN0_CANRX0 on PA9 mux B */
#define MUX_PA9B_CAN0_CANRX0                       _L_(1)       /**< CAN0 signal line function value: CAN0_CANRX0 */
#define PIO_PA9B_CAN0_CANRX0                       _UL_(1 << 9) /**< CAN0 signal: CAN0_CANRX0 */
#define PIN_PA10B_CAN0_CANTX0                      _L_(10)      /**< CAN0 signal: CAN0_CANTX0 on PA10 mux B */
#define MUX_PA10B_CAN0_CANTX0                      _L_(1)       /**< CAN0 signal line function value: CAN0_CANTX0 */
#define PIO_PA10B_CAN0_CANTX0                      _UL_(1 << 10) /**< CAN0 signal: CAN0_CANTX0 */
/* ========== PIO definition for CAN1 peripheral ========== */
#define PIN_PA6B_CAN1_CANRX1                       _L_(6)       /**< CAN1 signal: CAN1_CANRX1 on PA6 mux B */
#define MUX_PA6B_CAN1_CANRX1                       _L_(1)       /**< CAN1 signal line function value: CAN1_CANRX1 */
#define PIO_PA6B_CAN1_CANRX1                       _UL_(1 << 6) /**< CAN1 signal: CAN1_CANRX1 */
#define PIN_PA5B_CAN1_CANTX1                       _L_(5)       /**< CAN1 signal: CAN1_CANTX1 on PA5 mux B */
#define MUX_PA5B_CAN1_CANTX1                       _L_(1)       /**< CAN1 signal line function value: CAN1_CANTX1 */
#define PIO_PA5B_CAN1_CANTX1                       _UL_(1 << 5) /**< CAN1 signal: CAN1_CANTX1 */
/* ========== PIO definition for CLASSD peripheral ========== */
#define PIN_PA24C_CLASSD_CLASSD_L0                 _L_(24)      /**< CLASSD signal: CLASSD_CLASSD_L0 on PA24 mux C */
#define MUX_PA24C_CLASSD_CLASSD_L0                 _L_(2)       /**< CLASSD signal line function value: CLASSD_CLASSD_L0 */
#define PIO_PA24C_CLASSD_CLASSD_L0                 _UL_(1 << 24) /**< CLASSD signal: CLASSD_CLASSD_L0 */
#define PIN_PA25C_CLASSD_CLASSD_L1                 _L_(25)      /**< CLASSD signal: CLASSD_CLASSD_L1 on PA25 mux C */
#define MUX_PA25C_CLASSD_CLASSD_L1                 _L_(2)       /**< CLASSD signal line function value: CLASSD_CLASSD_L1 */
#define PIO_PA25C_CLASSD_CLASSD_L1                 _UL_(1 << 25) /**< CLASSD signal: CLASSD_CLASSD_L1 */
#define PIN_PA26C_CLASSD_CLASSD_L2                 _L_(26)      /**< CLASSD signal: CLASSD_CLASSD_L2 on PA26 mux C */
#define MUX_PA26C_CLASSD_CLASSD_L2                 _L_(2)       /**< CLASSD signal line function value: CLASSD_CLASSD_L2 */
#define PIO_PA26C_CLASSD_CLASSD_L2                 _UL_(1 << 26) /**< CLASSD signal: CLASSD_CLASSD_L2 */
#define PIN_PA27C_CLASSD_CLASSD_L3                 _L_(27)      /**< CLASSD signal: CLASSD_CLASSD_L3 on PA27 mux C */
#define MUX_PA27C_CLASSD_CLASSD_L3                 _L_(2)       /**< CLASSD signal line function value: CLASSD_CLASSD_L3 */
#define PIO_PA27C_CLASSD_CLASSD_L3                 _UL_(1 << 27) /**< CLASSD signal: CLASSD_CLASSD_L3 */
/* ========== PIO definition for DBGU peripheral ========== */
#define PIN_PA9A_DBGU_DRXD                         _L_(9)       /**< DBGU signal: DBGU_DRXD on PA9 mux A */
#define MUX_PA9A_DBGU_DRXD                         _L_(0)       /**< DBGU signal line function value: DBGU_DRXD */
#define PIO_PA9A_DBGU_DRXD                         _UL_(1 << 9) /**< DBGU signal: DBGU_DRXD */
#define PIN_PA10A_DBGU_DTXD                        _L_(10)      /**< DBGU signal: DBGU_DTXD on PA10 mux A */
#define MUX_PA10A_DBGU_DTXD                        _L_(0)       /**< DBGU signal line function value: DBGU_DTXD */
#define PIO_PA10A_DBGU_DTXD                        _UL_(1 << 10) /**< DBGU signal: DBGU_DTXD */
/* ========== PIO definition for EMAC0 peripheral ========== */
#define PIN_PB17A_EMAC0_E0_COL                     _L_(49)      /**< EMAC0 signal: EMAC0_E0_COL on PB17 mux A */
#define MUX_PB17A_EMAC0_E0_COL                     _L_(0)       /**< EMAC0 signal line function value: EMAC0_E0_COL */
#define PIO_PB17A_EMAC0_E0_COL                     _UL_(1 << 17) /**< EMAC0 signal: EMAC0_E0_COL */
#define PIN_PB16A_EMAC0_E0_CRS                     _L_(48)      /**< EMAC0 signal: EMAC0_E0_CRS on PB16 mux A */
#define MUX_PB16A_EMAC0_E0_CRS                     _L_(0)       /**< EMAC0 signal line function value: EMAC0_E0_CRS */
#define PIO_PB16A_EMAC0_E0_CRS                     _UL_(1 << 16) /**< EMAC0 signal: EMAC0_E0_CRS */
#define PIN_PA30C_EMAC0_E0_MDC                     _L_(30)      /**< EMAC0 signal: EMAC0_E0_MDC on PA30 mux C */
#define MUX_PA30C_EMAC0_E0_MDC                     _L_(2)       /**< EMAC0 signal line function value: EMAC0_E0_MDC */
#define PIO_PA30C_EMAC0_E0_MDC                     _UL_(1 << 30) /**< EMAC0 signal: EMAC0_E0_MDC */
#define PIN_PB6A_EMAC0_E0_MDC                      _L_(38)      /**< EMAC0 signal: EMAC0_E0_MDC on PB6 mux A */
#define MUX_PB6A_EMAC0_E0_MDC                      _L_(0)       /**< EMAC0 signal line function value: EMAC0_E0_MDC */
#define PIO_PB6A_EMAC0_E0_MDC                      _UL_(1 << 6) /**< EMAC0 signal: EMAC0_E0_MDC */
#define PIN_PB5A_EMAC0_E0_MDIO                     _L_(37)      /**< EMAC0 signal: EMAC0_E0_MDIO on PB5 mux A */
#define MUX_PB5A_EMAC0_E0_MDIO                     _L_(0)       /**< EMAC0 signal line function value: EMAC0_E0_MDIO */
#define PIO_PB5A_EMAC0_E0_MDIO                     _UL_(1 << 5) /**< EMAC0 signal: EMAC0_E0_MDIO */
#define PIN_PB15A_EMAC0_E0_RXCK                    _L_(47)      /**< EMAC0 signal: EMAC0_E0_RXCK on PB15 mux A */
#define MUX_PB15A_EMAC0_E0_RXCK                    _L_(0)       /**< EMAC0 signal line function value: EMAC0_E0_RXCK */
#define PIO_PB15A_EMAC0_E0_RXCK                    _UL_(1 << 15) /**< EMAC0 signal: EMAC0_E0_RXCK */
#define PIN_PB3A_EMAC0_E0_RXDV                     _L_(35)      /**< EMAC0 signal: EMAC0_E0_RXDV on PB3 mux A */
#define MUX_PB3A_EMAC0_E0_RXDV                     _L_(0)       /**< EMAC0 signal line function value: EMAC0_E0_RXDV */
#define PIO_PB3A_EMAC0_E0_RXDV                     _UL_(1 << 3) /**< EMAC0 signal: EMAC0_E0_RXDV */
#define PIN_PB2A_EMAC0_E0_RXER                     _L_(34)      /**< EMAC0 signal: EMAC0_E0_RXER on PB2 mux A */
#define MUX_PB2A_EMAC0_E0_RXER                     _L_(0)       /**< EMAC0 signal line function value: EMAC0_E0_RXER */
#define PIO_PB2A_EMAC0_E0_RXER                     _UL_(1 << 2) /**< EMAC0 signal: EMAC0_E0_RXER */
#define PIN_PB0A_EMAC0_E0_RX0                      _L_(32)      /**< EMAC0 signal: EMAC0_E0_RX0 on PB0 mux A */
#define MUX_PB0A_EMAC0_E0_RX0                      _L_(0)       /**< EMAC0 signal line function value: EMAC0_E0_RX0 */
#define PIO_PB0A_EMAC0_E0_RX0                      _UL_(1 << 0) /**< EMAC0 signal: EMAC0_E0_RX0 */
#define PIN_PB1A_EMAC0_E0_RX1                      _L_(33)      /**< EMAC0 signal: EMAC0_E0_RX1 on PB1 mux A */
#define MUX_PB1A_EMAC0_E0_RX1                      _L_(0)       /**< EMAC0 signal line function value: EMAC0_E0_RX1 */
#define PIO_PB1A_EMAC0_E0_RX1                      _UL_(1 << 1) /**< EMAC0 signal: EMAC0_E0_RX1 */
#define PIN_PB13A_EMAC0_E0_RX2                     _L_(45)      /**< EMAC0 signal: EMAC0_E0_RX2 on PB13 mux A */
#define MUX_PB13A_EMAC0_E0_RX2                     _L_(0)       /**< EMAC0 signal line function value: EMAC0_E0_RX2 */
#define PIO_PB13A_EMAC0_E0_RX2                     _UL_(1 << 13) /**< EMAC0 signal: EMAC0_E0_RX2 */
#define PIN_PB14A_EMAC0_E0_RX3                     _L_(46)      /**< EMAC0 signal: EMAC0_E0_RX3 on PB14 mux A */
#define MUX_PB14A_EMAC0_E0_RX3                     _L_(0)       /**< EMAC0 signal line function value: EMAC0_E0_RX3 */
#define PIO_PB14A_EMAC0_E0_RX3                     _UL_(1 << 14) /**< EMAC0 signal: EMAC0_E0_RX3 */
#define PIN_PB4A_EMAC0_E0_TXCK                     _L_(36)      /**< EMAC0 signal: EMAC0_E0_TXCK on PB4 mux A */
#define MUX_PB4A_EMAC0_E0_TXCK                     _L_(0)       /**< EMAC0 signal line function value: EMAC0_E0_TXCK */
#define PIO_PB4A_EMAC0_E0_TXCK                     _UL_(1 << 4) /**< EMAC0 signal: EMAC0_E0_TXCK */
#define PIN_PA31C_EMAC0_E0_TXEN                    _L_(31)      /**< EMAC0 signal: EMAC0_E0_TXEN on PA31 mux C */
#define MUX_PA31C_EMAC0_E0_TXEN                    _L_(2)       /**< EMAC0 signal line function value: EMAC0_E0_TXEN */
#define PIO_PA31C_EMAC0_E0_TXEN                    _UL_(1 << 31) /**< EMAC0 signal: EMAC0_E0_TXEN */
#define PIN_PB7A_EMAC0_E0_TXEN                     _L_(39)      /**< EMAC0 signal: EMAC0_E0_TXEN on PB7 mux A */
#define MUX_PB7A_EMAC0_E0_TXEN                     _L_(0)       /**< EMAC0 signal line function value: EMAC0_E0_TXEN */
#define PIO_PB7A_EMAC0_E0_TXEN                     _UL_(1 << 7) /**< EMAC0 signal: EMAC0_E0_TXEN */
#define PIN_PA4C_EMAC0_E0_TXER                     _L_(4)       /**< EMAC0 signal: EMAC0_E0_TXER on PA4 mux C */
#define MUX_PA4C_EMAC0_E0_TXER                     _L_(2)       /**< EMAC0 signal line function value: EMAC0_E0_TXER */
#define PIO_PA4C_EMAC0_E0_TXER                     _UL_(1 << 4) /**< EMAC0 signal: EMAC0_E0_TXER */
#define PIN_PB8A_EMAC0_E0_TXER                     _L_(40)      /**< EMAC0 signal: EMAC0_E0_TXER on PB8 mux A */
#define MUX_PB8A_EMAC0_E0_TXER                     _L_(0)       /**< EMAC0 signal line function value: EMAC0_E0_TXER */
#define PIO_PB8A_EMAC0_E0_TXER                     _UL_(1 << 8) /**< EMAC0 signal: EMAC0_E0_TXER */
#define PIN_PA2C_EMAC0_E0_TX0                      _L_(2)       /**< EMAC0 signal: EMAC0_E0_TX0 on PA2 mux C */
#define MUX_PA2C_EMAC0_E0_TX0                      _L_(2)       /**< EMAC0 signal line function value: EMAC0_E0_TX0 */
#define PIO_PA2C_EMAC0_E0_TX0                      _UL_(1 << 2) /**< EMAC0 signal: EMAC0_E0_TX0 */
#define PIN_PB9A_EMAC0_E0_TX0                      _L_(41)      /**< EMAC0 signal: EMAC0_E0_TX0 on PB9 mux A */
#define MUX_PB9A_EMAC0_E0_TX0                      _L_(0)       /**< EMAC0 signal line function value: EMAC0_E0_TX0 */
#define PIO_PB9A_EMAC0_E0_TX0                      _UL_(1 << 9) /**< EMAC0 signal: EMAC0_E0_TX0 */
#define PIN_PA3C_EMAC0_E0_TX1                      _L_(3)       /**< EMAC0 signal: EMAC0_E0_TX1 on PA3 mux C */
#define MUX_PA3C_EMAC0_E0_TX1                      _L_(2)       /**< EMAC0 signal line function value: EMAC0_E0_TX1 */
#define PIO_PA3C_EMAC0_E0_TX1                      _UL_(1 << 3) /**< EMAC0 signal: EMAC0_E0_TX1 */
#define PIN_PB10A_EMAC0_E0_TX1                     _L_(42)      /**< EMAC0 signal: EMAC0_E0_TX1 on PB10 mux A */
#define MUX_PB10A_EMAC0_E0_TX1                     _L_(0)       /**< EMAC0 signal line function value: EMAC0_E0_TX1 */
#define PIO_PB10A_EMAC0_E0_TX1                     _UL_(1 << 10) /**< EMAC0 signal: EMAC0_E0_TX1 */
#define PIN_PB11A_EMAC0_E0_TX2                     _L_(43)      /**< EMAC0 signal: EMAC0_E0_TX2 on PB11 mux A */
#define MUX_PB11A_EMAC0_E0_TX2                     _L_(0)       /**< EMAC0 signal line function value: EMAC0_E0_TX2 */
#define PIO_PB11A_EMAC0_E0_TX2                     _UL_(1 << 11) /**< EMAC0 signal: EMAC0_E0_TX2 */
#define PIN_PB12A_EMAC0_E0_TX3                     _L_(44)      /**< EMAC0 signal: EMAC0_E0_TX3 on PB12 mux A */
#define MUX_PB12A_EMAC0_E0_TX3                     _L_(0)       /**< EMAC0 signal line function value: EMAC0_E0_TX3 */
#define PIO_PB12A_EMAC0_E0_TX3                     _UL_(1 << 12) /**< EMAC0 signal: EMAC0_E0_TX3 */
/* ========== PIO definition for EMAC1 peripheral ========== */
#define PIN_PC28B_EMAC1_E1_CRSDV                   _L_(86)      /**< EMAC1 signal: EMAC1_E1_CRSDV on PC28 mux B */
#define MUX_PC28B_EMAC1_E1_CRSDV                   _L_(1)       /**< EMAC1 signal line function value: EMAC1_E1_CRSDV */
#define PIO_PC28B_EMAC1_E1_CRSDV                   _UL_(1 << 22) /**< EMAC1 signal: EMAC1_E1_CRSDV */
#define PIN_PC30B_EMAC1_E1_MDC                     _L_(88)      /**< EMAC1 signal: EMAC1_E1_MDC on PC30 mux B */
#define MUX_PC30B_EMAC1_E1_MDC                     _L_(1)       /**< EMAC1 signal line function value: EMAC1_E1_MDC */
#define PIO_PC30B_EMAC1_E1_MDC                     _UL_(1 << 24) /**< EMAC1 signal: EMAC1_E1_MDC */
#define PIN_PC31B_EMAC1_E1_MDIO                    _L_(89)      /**< EMAC1 signal: EMAC1_E1_MDIO on PC31 mux B */
#define MUX_PC31B_EMAC1_E1_MDIO                    _L_(1)       /**< EMAC1 signal line function value: EMAC1_E1_MDIO */
#define PIO_PC31B_EMAC1_E1_MDIO                    _UL_(1 << 25) /**< EMAC1 signal: EMAC1_E1_MDIO */
#define PIN_PC16B_EMAC1_E1_RXER                    _L_(74)      /**< EMAC1 signal: EMAC1_E1_RXER on PC16 mux B */
#define MUX_PC16B_EMAC1_E1_RXER                    _L_(1)       /**< EMAC1 signal line function value: EMAC1_E1_RXER */
#define PIO_PC16B_EMAC1_E1_RXER                    _UL_(1 << 10) /**< EMAC1 signal: EMAC1_E1_RXER */
#define PIN_PC20B_EMAC1_E1_RX0                     _L_(78)      /**< EMAC1 signal: EMAC1_E1_RX0 on PC20 mux B */
#define MUX_PC20B_EMAC1_E1_RX0                     _L_(1)       /**< EMAC1 signal line function value: EMAC1_E1_RX0 */
#define PIO_PC20B_EMAC1_E1_RX0                     _UL_(1 << 14) /**< EMAC1 signal: EMAC1_E1_RX0 */
#define PIN_PC21B_EMAC1_E1_RX1                     _L_(79)      /**< EMAC1 signal: EMAC1_E1_RX1 on PC21 mux B */
#define MUX_PC21B_EMAC1_E1_RX1                     _L_(1)       /**< EMAC1 signal line function value: EMAC1_E1_RX1 */
#define PIO_PC21B_EMAC1_E1_RX1                     _UL_(1 << 15) /**< EMAC1 signal: EMAC1_E1_RX1 */
#define PIN_PC29B_EMAC1_E1_TXCK                    _L_(87)      /**< EMAC1 signal: EMAC1_E1_TXCK on PC29 mux B */
#define MUX_PC29B_EMAC1_E1_TXCK                    _L_(1)       /**< EMAC1 signal line function value: EMAC1_E1_TXCK */
#define PIO_PC29B_EMAC1_E1_TXCK                    _UL_(1 << 23) /**< EMAC1 signal: EMAC1_E1_TXCK */
#define PIN_PC27B_EMAC1_E1_TXEN                    _L_(85)      /**< EMAC1 signal: EMAC1_E1_TXEN on PC27 mux B */
#define MUX_PC27B_EMAC1_E1_TXEN                    _L_(1)       /**< EMAC1 signal line function value: EMAC1_E1_TXEN */
#define PIO_PC27B_EMAC1_E1_TXEN                    _UL_(1 << 21) /**< EMAC1 signal: EMAC1_E1_TXEN */
#define PIN_PC18B_EMAC1_E1_TX0                     _L_(76)      /**< EMAC1 signal: EMAC1_E1_TX0 on PC18 mux B */
#define MUX_PC18B_EMAC1_E1_TX0                     _L_(1)       /**< EMAC1 signal line function value: EMAC1_E1_TX0 */
#define PIO_PC18B_EMAC1_E1_TX0                     _UL_(1 << 12) /**< EMAC1 signal: EMAC1_E1_TX0 */
#define PIN_PC19B_EMAC1_E1_TX1                     _L_(77)      /**< EMAC1 signal: EMAC1_E1_TX1 on PC19 mux B */
#define MUX_PC19B_EMAC1_E1_TX1                     _L_(1)       /**< EMAC1 signal line function value: EMAC1_E1_TX1 */
#define PIO_PC19B_EMAC1_E1_TX1                     _UL_(1 << 13) /**< EMAC1 signal: EMAC1_E1_TX1 */
/* ========== PIO definition for FLEXCOM0 peripheral ========== */
#define PIN_PA0A_FLEXCOM0_FLEXCOM0_IO0             _L_(0)       /**< FLEXCOM0 signal: FLEXCOM0_FLEXCOM0_IO0 on PA0 mux A */
#define MUX_PA0A_FLEXCOM0_FLEXCOM0_IO0             _L_(0)       /**< FLEXCOM0 signal line function value: FLEXCOM0_FLEXCOM0_IO0 */
#define PIO_PA0A_FLEXCOM0_FLEXCOM0_IO0             _UL_(1 << 0) /**< FLEXCOM0 signal: FLEXCOM0_FLEXCOM0_IO0 */
#define PIN_PA1A_FLEXCOM0_FLEXCOM0_IO1             _L_(1)       /**< FLEXCOM0 signal: FLEXCOM0_FLEXCOM0_IO1 on PA1 mux A */
#define MUX_PA1A_FLEXCOM0_FLEXCOM0_IO1             _L_(0)       /**< FLEXCOM0 signal line function value: FLEXCOM0_FLEXCOM0_IO1 */
#define PIO_PA1A_FLEXCOM0_FLEXCOM0_IO1             _UL_(1 << 1) /**< FLEXCOM0 signal: FLEXCOM0_FLEXCOM0_IO1 */
#define PIN_PA4A_FLEXCOM0_FLEXCOM0_IO2             _L_(4)       /**< FLEXCOM0 signal: FLEXCOM0_FLEXCOM0_IO2 on PA4 mux A */
#define MUX_PA4A_FLEXCOM0_FLEXCOM0_IO2             _L_(0)       /**< FLEXCOM0 signal line function value: FLEXCOM0_FLEXCOM0_IO2 */
#define PIO_PA4A_FLEXCOM0_FLEXCOM0_IO2             _UL_(1 << 4) /**< FLEXCOM0 signal: FLEXCOM0_FLEXCOM0_IO2 */
#define PIN_PA3A_FLEXCOM0_FLEXCOM0_IO3             _L_(3)       /**< FLEXCOM0 signal: FLEXCOM0_FLEXCOM0_IO3 on PA3 mux A */
#define MUX_PA3A_FLEXCOM0_FLEXCOM0_IO3             _L_(0)       /**< FLEXCOM0 signal line function value: FLEXCOM0_FLEXCOM0_IO3 */
#define PIO_PA3A_FLEXCOM0_FLEXCOM0_IO3             _UL_(1 << 3) /**< FLEXCOM0 signal: FLEXCOM0_FLEXCOM0_IO3 */
#define PIN_PA2A_FLEXCOM0_FLEXCOM0_IO4             _L_(2)       /**< FLEXCOM0 signal: FLEXCOM0_FLEXCOM0_IO4 on PA2 mux A */
#define MUX_PA2A_FLEXCOM0_FLEXCOM0_IO4             _L_(0)       /**< FLEXCOM0 signal line function value: FLEXCOM0_FLEXCOM0_IO4 */
#define PIO_PA2A_FLEXCOM0_FLEXCOM0_IO4             _UL_(1 << 2) /**< FLEXCOM0 signal: FLEXCOM0_FLEXCOM0_IO4 */
#define PIN_PB6B_FLEXCOM0_FLEXCOM0_IO7             _L_(38)      /**< FLEXCOM0 signal: FLEXCOM0_FLEXCOM0_IO7 on PB6 mux B */
#define MUX_PB6B_FLEXCOM0_FLEXCOM0_IO7             _L_(1)       /**< FLEXCOM0 signal line function value: FLEXCOM0_FLEXCOM0_IO7 */
#define PIO_PB6B_FLEXCOM0_FLEXCOM0_IO7             _UL_(1 << 6) /**< FLEXCOM0 signal: FLEXCOM0_FLEXCOM0_IO7 */
/* ========== PIO definition for FLEXCOM1 peripheral ========== */
#define PIN_PA5A_FLEXCOM1_FLEXCOM1_IO0             _L_(5)       /**< FLEXCOM1 signal: FLEXCOM1_FLEXCOM1_IO0 on PA5 mux A */
#define MUX_PA5A_FLEXCOM1_FLEXCOM1_IO0             _L_(0)       /**< FLEXCOM1 signal line function value: FLEXCOM1_FLEXCOM1_IO0 */
#define PIO_PA5A_FLEXCOM1_FLEXCOM1_IO0             _UL_(1 << 5) /**< FLEXCOM1 signal: FLEXCOM1_FLEXCOM1_IO0 */
#define PIN_PA6A_FLEXCOM1_FLEXCOM1_IO1             _L_(6)       /**< FLEXCOM1 signal: FLEXCOM1_FLEXCOM1_IO1 on PA6 mux A */
#define MUX_PA6A_FLEXCOM1_FLEXCOM1_IO1             _L_(0)       /**< FLEXCOM1 signal line function value: FLEXCOM1_FLEXCOM1_IO1 */
#define PIO_PA6A_FLEXCOM1_FLEXCOM1_IO1             _UL_(1 << 6) /**< FLEXCOM1 signal: FLEXCOM1_FLEXCOM1_IO1 */
#define PIN_PC29C_FLEXCOM1_FLEXCOM1_IO2            _L_(87)      /**< FLEXCOM1 signal: FLEXCOM1_FLEXCOM1_IO2 on PC29 mux C */
#define MUX_PC29C_FLEXCOM1_FLEXCOM1_IO2            _L_(2)       /**< FLEXCOM1 signal line function value: FLEXCOM1_FLEXCOM1_IO2 */
#define PIO_PC29C_FLEXCOM1_FLEXCOM1_IO2            _UL_(1 << 23) /**< FLEXCOM1 signal: FLEXCOM1_FLEXCOM1_IO2 */
#define PIN_PC28C_FLEXCOM1_FLEXCOM1_IO3            _L_(86)      /**< FLEXCOM1 signal: FLEXCOM1_FLEXCOM1_IO3 on PC28 mux C */
#define MUX_PC28C_FLEXCOM1_FLEXCOM1_IO3            _L_(2)       /**< FLEXCOM1 signal line function value: FLEXCOM1_FLEXCOM1_IO3 */
#define PIO_PC28C_FLEXCOM1_FLEXCOM1_IO3            _UL_(1 << 22) /**< FLEXCOM1 signal: FLEXCOM1_FLEXCOM1_IO3 */
#define PIN_PC27C_FLEXCOM1_FLEXCOM1_IO4            _L_(85)      /**< FLEXCOM1 signal: FLEXCOM1_FLEXCOM1_IO4 on PC27 mux C */
#define MUX_PC27C_FLEXCOM1_FLEXCOM1_IO4            _L_(2)       /**< FLEXCOM1 signal line function value: FLEXCOM1_FLEXCOM1_IO4 */
#define PIO_PC27C_FLEXCOM1_FLEXCOM1_IO4            _UL_(1 << 21) /**< FLEXCOM1 signal: FLEXCOM1_FLEXCOM1_IO4 */
#define PIN_PC17B_FLEXCOM1_FLEXCOM1_IO7            _L_(75)      /**< FLEXCOM1 signal: FLEXCOM1_FLEXCOM1_IO7 on PC17 mux B */
#define MUX_PC17B_FLEXCOM1_FLEXCOM1_IO7            _L_(1)       /**< FLEXCOM1 signal line function value: FLEXCOM1_FLEXCOM1_IO7 */
#define PIO_PC17B_FLEXCOM1_FLEXCOM1_IO7            _UL_(1 << 11) /**< FLEXCOM1 signal: FLEXCOM1_FLEXCOM1_IO7 */
/* ========== PIO definition for FLEXCOM2 peripheral ========== */
#define PIN_PA7A_FLEXCOM2_FLEXCOM2_IO0             _L_(7)       /**< FLEXCOM2 signal: FLEXCOM2_FLEXCOM2_IO0 on PA7 mux A */
#define MUX_PA7A_FLEXCOM2_FLEXCOM2_IO0             _L_(0)       /**< FLEXCOM2 signal line function value: FLEXCOM2_FLEXCOM2_IO0 */
#define PIO_PA7A_FLEXCOM2_FLEXCOM2_IO0             _UL_(1 << 7) /**< FLEXCOM2 signal: FLEXCOM2_FLEXCOM2_IO0 */
#define PIN_PA8A_FLEXCOM2_FLEXCOM2_IO1             _L_(8)       /**< FLEXCOM2 signal: FLEXCOM2_FLEXCOM2_IO1 on PA8 mux A */
#define MUX_PA8A_FLEXCOM2_FLEXCOM2_IO1             _L_(0)       /**< FLEXCOM2 signal line function value: FLEXCOM2_FLEXCOM2_IO1 */
#define PIO_PA8A_FLEXCOM2_FLEXCOM2_IO1             _UL_(1 << 8) /**< FLEXCOM2 signal: FLEXCOM2_FLEXCOM2_IO1 */
#define PIN_PB2B_FLEXCOM2_FLEXCOM2_IO2             _L_(34)      /**< FLEXCOM2 signal: FLEXCOM2_FLEXCOM2_IO2 on PB2 mux B */
#define MUX_PB2B_FLEXCOM2_FLEXCOM2_IO2             _L_(1)       /**< FLEXCOM2 signal line function value: FLEXCOM2_FLEXCOM2_IO2 */
