Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/pio/sam9x60.h
#define MUX_PC3A_LCDC_LCDDAT3                      _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT3 */
#define PIO_PC3A_LCDC_LCDDAT3                      _UL_(1 << 29) /**< LCDC signal: LCDC_LCDDAT3 */
#define PIN_PC4A_LCDC_LCDDAT4                      _L_(62)      /**< LCDC signal: LCDC_LCDDAT4 on PC4 mux A */
#define MUX_PC4A_LCDC_LCDDAT4                      _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT4 */
#define PIO_PC4A_LCDC_LCDDAT4                      _UL_(1 << 30) /**< LCDC signal: LCDC_LCDDAT4 */
#define PIN_PC5A_LCDC_LCDDAT5                      _L_(63)      /**< LCDC signal: LCDC_LCDDAT5 on PC5 mux A */
#define MUX_PC5A_LCDC_LCDDAT5                      _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT5 */
#define PIO_PC5A_LCDC_LCDDAT5                      _UL_(1 << 31) /**< LCDC signal: LCDC_LCDDAT5 */
#define PIN_PC6A_LCDC_LCDDAT6                      _L_(64)      /**< LCDC signal: LCDC_LCDDAT6 on PC6 mux A */
#define MUX_PC6A_LCDC_LCDDAT6                      _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT6 */
#define PIO_PC6A_LCDC_LCDDAT6                      _UL_(1 << 0) /**< LCDC signal: LCDC_LCDDAT6 */
#define PIN_PC7A_LCDC_LCDDAT7                      _L_(65)      /**< LCDC signal: LCDC_LCDDAT7 on PC7 mux A */
#define MUX_PC7A_LCDC_LCDDAT7                      _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT7 */
#define PIO_PC7A_LCDC_LCDDAT7                      _UL_(1 << 1) /**< LCDC signal: LCDC_LCDDAT7 */
#define PIN_PC8A_LCDC_LCDDAT8                      _L_(66)      /**< LCDC signal: LCDC_LCDDAT8 on PC8 mux A */
#define MUX_PC8A_LCDC_LCDDAT8                      _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT8 */
#define PIO_PC8A_LCDC_LCDDAT8                      _UL_(1 << 2) /**< LCDC signal: LCDC_LCDDAT8 */
#define PIN_PC9A_LCDC_LCDDAT9                      _L_(67)      /**< LCDC signal: LCDC_LCDDAT9 on PC9 mux A */
#define MUX_PC9A_LCDC_LCDDAT9                      _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT9 */
#define PIO_PC9A_LCDC_LCDDAT9                      _UL_(1 << 3) /**< LCDC signal: LCDC_LCDDAT9 */
#define PIN_PC10A_LCDC_LCDDAT10                    _L_(68)      /**< LCDC signal: LCDC_LCDDAT10 on PC10 mux A */
#define MUX_PC10A_LCDC_LCDDAT10                    _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT10 */
#define PIO_PC10A_LCDC_LCDDAT10                    _UL_(1 << 4) /**< LCDC signal: LCDC_LCDDAT10 */
#define PIN_PC11A_LCDC_LCDDAT11                    _L_(69)      /**< LCDC signal: LCDC_LCDDAT11 on PC11 mux A */
#define MUX_PC11A_LCDC_LCDDAT11                    _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT11 */
#define PIO_PC11A_LCDC_LCDDAT11                    _UL_(1 << 5) /**< LCDC signal: LCDC_LCDDAT11 */
#define PIN_PC12A_LCDC_LCDDAT12                    _L_(70)      /**< LCDC signal: LCDC_LCDDAT12 on PC12 mux A */
#define MUX_PC12A_LCDC_LCDDAT12                    _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT12 */
#define PIO_PC12A_LCDC_LCDDAT12                    _UL_(1 << 6) /**< LCDC signal: LCDC_LCDDAT12 */
#define PIN_PC13A_LCDC_LCDDAT13                    _L_(71)      /**< LCDC signal: LCDC_LCDDAT13 on PC13 mux A */
#define MUX_PC13A_LCDC_LCDDAT13                    _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT13 */
#define PIO_PC13A_LCDC_LCDDAT13                    _UL_(1 << 7) /**< LCDC signal: LCDC_LCDDAT13 */
#define PIN_PC14A_LCDC_LCDDAT14                    _L_(72)      /**< LCDC signal: LCDC_LCDDAT14 on PC14 mux A */
#define MUX_PC14A_LCDC_LCDDAT14                    _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT14 */
#define PIO_PC14A_LCDC_LCDDAT14                    _UL_(1 << 8) /**< LCDC signal: LCDC_LCDDAT14 */
#define PIN_PC15A_LCDC_LCDDAT15                    _L_(73)      /**< LCDC signal: LCDC_LCDDAT15 on PC15 mux A */
#define MUX_PC15A_LCDC_LCDDAT15                    _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT15 */
#define PIO_PC15A_LCDC_LCDDAT15                    _UL_(1 << 9) /**< LCDC signal: LCDC_LCDDAT15 */
#define PIN_PC16A_LCDC_LCDDAT16                    _L_(74)      /**< LCDC signal: LCDC_LCDDAT16 on PC16 mux A */
#define MUX_PC16A_LCDC_LCDDAT16                    _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT16 */
#define PIO_PC16A_LCDC_LCDDAT16                    _UL_(1 << 10) /**< LCDC signal: LCDC_LCDDAT16 */
#define PIN_PC17A_LCDC_LCDDAT17                    _L_(75)      /**< LCDC signal: LCDC_LCDDAT17 on PC17 mux A */
#define MUX_PC17A_LCDC_LCDDAT17                    _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT17 */
#define PIO_PC17A_LCDC_LCDDAT17                    _UL_(1 << 11) /**< LCDC signal: LCDC_LCDDAT17 */
#define PIN_PC18A_LCDC_LCDDAT18                    _L_(76)      /**< LCDC signal: LCDC_LCDDAT18 on PC18 mux A */
#define MUX_PC18A_LCDC_LCDDAT18                    _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT18 */
#define PIO_PC18A_LCDC_LCDDAT18                    _UL_(1 << 12) /**< LCDC signal: LCDC_LCDDAT18 */
#define PIN_PC19A_LCDC_LCDDAT19                    _L_(77)      /**< LCDC signal: LCDC_LCDDAT19 on PC19 mux A */
#define MUX_PC19A_LCDC_LCDDAT19                    _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT19 */
#define PIO_PC19A_LCDC_LCDDAT19                    _UL_(1 << 13) /**< LCDC signal: LCDC_LCDDAT19 */
#define PIN_PC20A_LCDC_LCDDAT20                    _L_(78)      /**< LCDC signal: LCDC_LCDDAT20 on PC20 mux A */
#define MUX_PC20A_LCDC_LCDDAT20                    _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT20 */
#define PIO_PC20A_LCDC_LCDDAT20                    _UL_(1 << 14) /**< LCDC signal: LCDC_LCDDAT20 */
#define PIN_PC21A_LCDC_LCDDAT21                    _L_(79)      /**< LCDC signal: LCDC_LCDDAT21 on PC21 mux A */
#define MUX_PC21A_LCDC_LCDDAT21                    _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT21 */
#define PIO_PC21A_LCDC_LCDDAT21                    _UL_(1 << 15) /**< LCDC signal: LCDC_LCDDAT21 */
#define PIN_PC22A_LCDC_LCDDAT22                    _L_(80)      /**< LCDC signal: LCDC_LCDDAT22 on PC22 mux A */
#define MUX_PC22A_LCDC_LCDDAT22                    _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT22 */
#define PIO_PC22A_LCDC_LCDDAT22                    _UL_(1 << 16) /**< LCDC signal: LCDC_LCDDAT22 */
#define PIN_PC23A_LCDC_LCDDAT23                    _L_(81)      /**< LCDC signal: LCDC_LCDDAT23 on PC23 mux A */
#define MUX_PC23A_LCDC_LCDDAT23                    _L_(0)       /**< LCDC signal line function value: LCDC_LCDDAT23 */
#define PIO_PC23A_LCDC_LCDDAT23                    _UL_(1 << 17) /**< LCDC signal: LCDC_LCDDAT23 */
#define PIN_PC29A_LCDC_LCDDEN                      _L_(87)      /**< LCDC signal: LCDC_LCDDEN on PC29 mux A */
#define MUX_PC29A_LCDC_LCDDEN                      _L_(0)       /**< LCDC signal line function value: LCDC_LCDDEN */
#define PIO_PC29A_LCDC_LCDDEN                      _UL_(1 << 23) /**< LCDC signal: LCDC_LCDDEN */
#define PIN_PC24A_LCDC_LCDDISP                     _L_(82)      /**< LCDC signal: LCDC_LCDDISP on PC24 mux A */
#define MUX_PC24A_LCDC_LCDDISP                     _L_(0)       /**< LCDC signal line function value: LCDC_LCDDISP */
#define PIO_PC24A_LCDC_LCDDISP                     _UL_(1 << 18) /**< LCDC signal: LCDC_LCDDISP */
#define PIN_PC28A_LCDC_LCDHSYNC                    _L_(86)      /**< LCDC signal: LCDC_LCDHSYNC on PC28 mux A */
#define MUX_PC28A_LCDC_LCDHSYNC                    _L_(0)       /**< LCDC signal line function value: LCDC_LCDHSYNC */
#define PIO_PC28A_LCDC_LCDHSYNC                    _UL_(1 << 22) /**< LCDC signal: LCDC_LCDHSYNC */
#define PIN_PC30A_LCDC_LCDPCK                      _L_(88)      /**< LCDC signal: LCDC_LCDPCK on PC30 mux A */
#define MUX_PC30A_LCDC_LCDPCK                      _L_(0)       /**< LCDC signal line function value: LCDC_LCDPCK */
#define PIO_PC30A_LCDC_LCDPCK                      _UL_(1 << 24) /**< LCDC signal: LCDC_LCDPCK */
#define PIN_PC26A_LCDC_LCDPWM                      _L_(84)      /**< LCDC signal: LCDC_LCDPWM on PC26 mux A */
#define MUX_PC26A_LCDC_LCDPWM                      _L_(0)       /**< LCDC signal line function value: LCDC_LCDPWM */
#define PIO_PC26A_LCDC_LCDPWM                      _UL_(1 << 20) /**< LCDC signal: LCDC_LCDPWM */
#define PIN_PC27A_LCDC_LCDVSYNC                    _L_(85)      /**< LCDC signal: LCDC_LCDVSYNC on PC27 mux A */
#define MUX_PC27A_LCDC_LCDVSYNC                    _L_(0)       /**< LCDC signal line function value: LCDC_LCDVSYNC */
#define PIO_PC27A_LCDC_LCDVSYNC                    _UL_(1 << 21) /**< LCDC signal: LCDC_LCDVSYNC */
/* ========== PIO definition for PMC peripheral ========== */
#define PIN_PB10B_PMC_PCK0                         _L_(42)      /**< PMC signal: PMC_PCK0 on PB10 mux B */
#define MUX_PB10B_PMC_PCK0                         _L_(1)       /**< PMC signal line function value: PMC_PCK0 */
#define PIO_PB10B_PMC_PCK0                         _UL_(1 << 10) /**< PMC signal: PMC_PCK0 */
#define PIN_PC15C_PMC_PCK0                         _L_(73)      /**< PMC signal: PMC_PCK0 on PC15 mux C */
#define MUX_PC15C_PMC_PCK0                         _L_(2)       /**< PMC signal line function value: PMC_PCK0 */
#define PIO_PC15C_PMC_PCK0                         _UL_(1 << 9) /**< PMC signal: PMC_PCK0 */
#define PIN_PB9B_PMC_PCK1                          _L_(41)      /**< PMC signal: PMC_PCK1 on PB9 mux B */
#define MUX_PB9B_PMC_PCK1                          _L_(1)       /**< PMC signal line function value: PMC_PCK1 */
#define PIO_PB9B_PMC_PCK1                          _UL_(1 << 9) /**< PMC signal: PMC_PCK1 */
#define PIN_PC31C_PMC_PCK1                         _L_(89)      /**< PMC signal: PMC_PCK1 on PC31 mux C */
#define MUX_PC31C_PMC_PCK1                         _L_(2)       /**< PMC signal line function value: PMC_PCK1 */
#define PIO_PC31C_PMC_PCK1                         _UL_(1 << 25) /**< PMC signal: PMC_PCK1 */
/* ========== PIO definition for PWM peripheral ========== */
#define PIN_PB11B_PWM_PWM0                         _L_(43)      /**< PWM signal: PWM_PWM0 on PB11 mux B */
#define MUX_PB11B_PWM_PWM0                         _L_(1)       /**< PWM signal line function value: PWM_PWM0 */
#define PIO_PB11B_PWM_PWM0                         _UL_(1 << 11) /**< PWM signal: PWM_PWM0 */
#define PIN_PC10C_PWM_PWM0                         _L_(68)      /**< PWM signal: PWM_PWM0 on PC10 mux C */
#define MUX_PC10C_PWM_PWM0                         _L_(2)       /**< PWM signal line function value: PWM_PWM0 */
#define PIO_PC10C_PWM_PWM0                         _UL_(1 << 4) /**< PWM signal: PWM_PWM0 */
#define PIN_PC18C_PWM_PWM0                         _L_(76)      /**< PWM signal: PWM_PWM0 on PC18 mux C */
#define MUX_PC18C_PWM_PWM0                         _L_(2)       /**< PWM signal line function value: PWM_PWM0 */
#define PIO_PC18C_PWM_PWM0                         _UL_(1 << 12) /**< PWM signal: PWM_PWM0 */
#define PIN_PB12B_PWM_PWM1                         _L_(44)      /**< PWM signal: PWM_PWM1 on PB12 mux B */
#define MUX_PB12B_PWM_PWM1                         _L_(1)       /**< PWM signal line function value: PWM_PWM1 */
#define PIO_PB12B_PWM_PWM1                         _UL_(1 << 12) /**< PWM signal: PWM_PWM1 */
#define PIN_PC11C_PWM_PWM1                         _L_(69)      /**< PWM signal: PWM_PWM1 on PC11 mux C */
#define MUX_PC11C_PWM_PWM1                         _L_(2)       /**< PWM signal line function value: PWM_PWM1 */
#define PIO_PC11C_PWM_PWM1                         _UL_(1 << 5) /**< PWM signal: PWM_PWM1 */
#define PIN_PC19C_PWM_PWM1                         _L_(77)      /**< PWM signal: PWM_PWM1 on PC19 mux C */
#define MUX_PC19C_PWM_PWM1                         _L_(2)       /**< PWM signal line function value: PWM_PWM1 */
#define PIO_PC19C_PWM_PWM1                         _UL_(1 << 13) /**< PWM signal: PWM_PWM1 */
#define PIN_PB13B_PWM_PWM2                         _L_(45)      /**< PWM signal: PWM_PWM2 on PB13 mux B */
#define MUX_PB13B_PWM_PWM2                         _L_(1)       /**< PWM signal line function value: PWM_PWM2 */
#define PIO_PB13B_PWM_PWM2                         _UL_(1 << 13) /**< PWM signal: PWM_PWM2 */
#define PIN_PC20C_PWM_PWM2                         _L_(78)      /**< PWM signal: PWM_PWM2 on PC20 mux C */
#define MUX_PC20C_PWM_PWM2                         _L_(2)       /**< PWM signal line function value: PWM_PWM2 */
#define PIO_PC20C_PWM_PWM2                         _UL_(1 << 14) /**< PWM signal: PWM_PWM2 */
#define PIN_PB14B_PWM_PWM3                         _L_(46)      /**< PWM signal: PWM_PWM3 on PB14 mux B */
#define MUX_PB14B_PWM_PWM3                         _L_(1)       /**< PWM signal line function value: PWM_PWM3 */
#define PIO_PB14B_PWM_PWM3                         _UL_(1 << 14) /**< PWM signal: PWM_PWM3 */
#define PIN_PC21C_PWM_PWM3                         _L_(79)      /**< PWM signal: PWM_PWM3 on PC21 mux C */
#define MUX_PC21C_PWM_PWM3                         _L_(2)       /**< PWM signal line function value: PWM_PWM3 */
#define PIO_PC21C_PWM_PWM3                         _UL_(1 << 15) /**< PWM signal: PWM_PWM3 */
/* ========== PIO definition for QSPI peripheral ========== */
#define PIN_PB20A_QSPI_QCS                         _L_(52)      /**< QSPI signal: QSPI_QCS on PB20 mux A */
#define MUX_PB20A_QSPI_QCS                         _L_(0)       /**< QSPI signal line function value: QSPI_QCS */
#define PIO_PB20A_QSPI_QCS                         _UL_(1 << 20) /**< QSPI signal: QSPI_QCS */
#define PIN_PB21A_QSPI_QIO0                        _L_(53)      /**< QSPI signal: QSPI_QIO0 on PB21 mux A */
#define MUX_PB21A_QSPI_QIO0                        _L_(0)       /**< QSPI signal line function value: QSPI_QIO0 */
#define PIO_PB21A_QSPI_QIO0                        _UL_(1 << 21) /**< QSPI signal: QSPI_QIO0 */
#define PIN_PB22A_QSPI_QIO1                        _L_(54)      /**< QSPI signal: QSPI_QIO1 on PB22 mux A */
#define MUX_PB22A_QSPI_QIO1                        _L_(0)       /**< QSPI signal line function value: QSPI_QIO1 */
#define PIO_PB22A_QSPI_QIO1                        _UL_(1 << 22) /**< QSPI signal: QSPI_QIO1 */
#define PIN_PB23A_QSPI_QIO2                        _L_(55)      /**< QSPI signal: QSPI_QIO2 on PB23 mux A */
#define MUX_PB23A_QSPI_QIO2                        _L_(0)       /**< QSPI signal line function value: QSPI_QIO2 */
#define PIO_PB23A_QSPI_QIO2                        _UL_(1 << 23) /**< QSPI signal: QSPI_QIO2 */
#define PIN_PB24A_QSPI_QIO3                        _L_(56)      /**< QSPI signal: QSPI_QIO3 on PB24 mux A */
#define MUX_PB24A_QSPI_QIO3                        _L_(0)       /**< QSPI signal line function value: QSPI_QIO3 */
#define PIO_PB24A_QSPI_QIO3                        _UL_(1 << 24) /**< QSPI signal: QSPI_QIO3 */
#define PIN_PB19A_QSPI_QSCK                        _L_(51)      /**< QSPI signal: QSPI_QSCK on PB19 mux A */
#define MUX_PB19A_QSPI_QSCK                        _L_(0)       /**< QSPI signal line function value: QSPI_QSCK */
#define PIO_PB19A_QSPI_QSCK                        _UL_(1 << 19) /**< QSPI signal: QSPI_QSCK */
/* ========== PIO definition for SDMMC0 peripheral ========== */
#define PIN_PA17A_SDMMC0_SDMMC0_CK                 _L_(17)      /**< SDMMC0 signal: SDMMC0_SDMMC0_CK on PA17 mux A */
#define MUX_PA17A_SDMMC0_SDMMC0_CK                 _L_(0)       /**< SDMMC0 signal line function value: SDMMC0_SDMMC0_CK */
#define PIO_PA17A_SDMMC0_SDMMC0_CK                 _UL_(1 << 17) /**< SDMMC0 signal: SDMMC0_SDMMC0_CK */
#define PIN_PA16A_SDMMC0_SDMMC0_CMD                _L_(16)      /**< SDMMC0 signal: SDMMC0_SDMMC0_CMD on PA16 mux A */
#define MUX_PA16A_SDMMC0_SDMMC0_CMD                _L_(0)       /**< SDMMC0 signal line function value: SDMMC0_SDMMC0_CMD */
#define PIO_PA16A_SDMMC0_SDMMC0_CMD                _UL_(1 << 16) /**< SDMMC0 signal: SDMMC0_SDMMC0_CMD */
#define PIN_PA15A_SDMMC0_SDMMC0_DAT0               _L_(15)      /**< SDMMC0 signal: SDMMC0_SDMMC0_DAT0 on PA15 mux A */
#define MUX_PA15A_SDMMC0_SDMMC0_DAT0               _L_(0)       /**< SDMMC0 signal line function value: SDMMC0_SDMMC0_DAT0 */
#define PIO_PA15A_SDMMC0_SDMMC0_DAT0               _UL_(1 << 15) /**< SDMMC0 signal: SDMMC0_SDMMC0_DAT0 */
#define PIN_PA18A_SDMMC0_SDMMC0_DAT1               _L_(18)      /**< SDMMC0 signal: SDMMC0_SDMMC0_DAT1 on PA18 mux A */
#define MUX_PA18A_SDMMC0_SDMMC0_DAT1               _L_(0)       /**< SDMMC0 signal line function value: SDMMC0_SDMMC0_DAT1 */
#define PIO_PA18A_SDMMC0_SDMMC0_DAT1               _UL_(1 << 18) /**< SDMMC0 signal: SDMMC0_SDMMC0_DAT1 */
#define PIN_PA19A_SDMMC0_SDMMC0_DAT2               _L_(19)      /**< SDMMC0 signal: SDMMC0_SDMMC0_DAT2 on PA19 mux A */
#define MUX_PA19A_SDMMC0_SDMMC0_DAT2               _L_(0)       /**< SDMMC0 signal line function value: SDMMC0_SDMMC0_DAT2 */
#define PIO_PA19A_SDMMC0_SDMMC0_DAT2               _UL_(1 << 19) /**< SDMMC0 signal: SDMMC0_SDMMC0_DAT2 */
#define PIN_PA20A_SDMMC0_SDMMC0_DAT3               _L_(20)      /**< SDMMC0 signal: SDMMC0_SDMMC0_DAT3 on PA20 mux A */
#define MUX_PA20A_SDMMC0_SDMMC0_DAT3               _L_(0)       /**< SDMMC0 signal line function value: SDMMC0_SDMMC0_DAT3 */
#define PIO_PA20A_SDMMC0_SDMMC0_DAT3               _UL_(1 << 20) /**< SDMMC0 signal: SDMMC0_SDMMC0_DAT3 */
/* ========== PIO definition for SDMMC1 peripheral ========== */
#define PIN_PA13B_SDMMC1_SDMMC1_CK                 _L_(13)      /**< SDMMC1 signal: SDMMC1_SDMMC1_CK on PA13 mux B */
#define MUX_PA13B_SDMMC1_SDMMC1_CK                 _L_(1)       /**< SDMMC1 signal line function value: SDMMC1_SDMMC1_CK */
#define PIO_PA13B_SDMMC1_SDMMC1_CK                 _UL_(1 << 13) /**< SDMMC1 signal: SDMMC1_SDMMC1_CK */
#define PIN_PA12B_SDMMC1_SDMMC1_CMD                _L_(12)      /**< SDMMC1 signal: SDMMC1_SDMMC1_CMD on PA12 mux B */
#define MUX_PA12B_SDMMC1_SDMMC1_CMD                _L_(1)       /**< SDMMC1 signal line function value: SDMMC1_SDMMC1_CMD */
#define PIO_PA12B_SDMMC1_SDMMC1_CMD                _UL_(1 << 12) /**< SDMMC1 signal: SDMMC1_SDMMC1_CMD */
#define PIN_PA11B_SDMMC1_SDMMC1_DAT0               _L_(11)      /**< SDMMC1 signal: SDMMC1_SDMMC1_DAT0 on PA11 mux B */
#define MUX_PA11B_SDMMC1_SDMMC1_DAT0               _L_(1)       /**< SDMMC1 signal line function value: SDMMC1_SDMMC1_DAT0 */
#define PIO_PA11B_SDMMC1_SDMMC1_DAT0               _UL_(1 << 11) /**< SDMMC1 signal: SDMMC1_SDMMC1_DAT0 */
#define PIN_PA2B_SDMMC1_SDMMC1_DAT1                _L_(2)       /**< SDMMC1 signal: SDMMC1_SDMMC1_DAT1 on PA2 mux B */
#define MUX_PA2B_SDMMC1_SDMMC1_DAT1                _L_(1)       /**< SDMMC1 signal line function value: SDMMC1_SDMMC1_DAT1 */
#define PIO_PA2B_SDMMC1_SDMMC1_DAT1                _UL_(1 << 2) /**< SDMMC1 signal: SDMMC1_SDMMC1_DAT1 */
#define PIN_PA3B_SDMMC1_SDMMC1_DAT2                _L_(3)       /**< SDMMC1 signal: SDMMC1_SDMMC1_DAT2 on PA3 mux B */
#define MUX_PA3B_SDMMC1_SDMMC1_DAT2                _L_(1)       /**< SDMMC1 signal line function value: SDMMC1_SDMMC1_DAT2 */
#define PIO_PA3B_SDMMC1_SDMMC1_DAT2                _UL_(1 << 3) /**< SDMMC1 signal: SDMMC1_SDMMC1_DAT2 */
#define PIN_PA4B_SDMMC1_SDMMC1_DAT3                _L_(4)       /**< SDMMC1 signal: SDMMC1_SDMMC1_DAT3 on PA4 mux B */
#define MUX_PA4B_SDMMC1_SDMMC1_DAT3                _L_(1)       /**< SDMMC1 signal line function value: SDMMC1_SDMMC1_DAT3 */
#define PIO_PA4B_SDMMC1_SDMMC1_DAT3                _UL_(1 << 4) /**< SDMMC1 signal: SDMMC1_SDMMC1_DAT3 */
/* ========== PIO definition for SSC peripheral ========== */
#define PIN_PA27B_SSC_RD                           _L_(27)      /**< SSC signal: SSC_RD on PA27 mux B */
#define MUX_PA27B_SSC_RD                           _L_(1)       /**< SSC signal line function value: SSC_RD */
#define PIO_PA27B_SSC_RD                           _UL_(1 << 27) /**< SSC signal: SSC_RD */
#define PIN_PA29B_SSC_RF                           _L_(29)      /**< SSC signal: SSC_RF on PA29 mux B */
#define MUX_PA29B_SSC_RF                           _L_(1)       /**< SSC signal line function value: SSC_RF */
#define PIO_PA29B_SSC_RF                           _UL_(1 << 29) /**< SSC signal: SSC_RF */
#define PIN_PA28B_SSC_RK                           _L_(28)      /**< SSC signal: SSC_RK on PA28 mux B */
#define MUX_PA28B_SSC_RK                           _L_(1)       /**< SSC signal line function value: SSC_RK */
#define PIO_PA28B_SSC_RK                           _UL_(1 << 28) /**< SSC signal: SSC_RK */
#define PIN_PA26B_SSC_TD                           _L_(26)      /**< SSC signal: SSC_TD on PA26 mux B */
#define MUX_PA26B_SSC_TD                           _L_(1)       /**< SSC signal line function value: SSC_TD */
#define PIO_PA26B_SSC_TD                           _UL_(1 << 26) /**< SSC signal: SSC_TD */
#define PIN_PA25B_SSC_TF                           _L_(25)      /**< SSC signal: SSC_TF on PA25 mux B */
#define MUX_PA25B_SSC_TF                           _L_(1)       /**< SSC signal line function value: SSC_TF */
#define PIO_PA25B_SSC_TF                           _UL_(1 << 25) /**< SSC signal: SSC_TF */
#define PIN_PA24B_SSC_TK                           _L_(24)      /**< SSC signal: SSC_TK on PA24 mux B */
#define MUX_PA24B_SSC_TK                           _L_(1)       /**< SSC signal line function value: SSC_TK */
#define PIO_PA24B_SSC_TK                           _UL_(1 << 24) /**< SSC signal: SSC_TK */
/* ========== PIO definition for TC0 peripheral ========== */
#define PIN_PA24A_TC0_TCLK0                        _L_(24)      /**< TC0 signal: TC0_TCLK0 on PA24 mux A */
#define MUX_PA24A_TC0_TCLK0                        _L_(0)       /**< TC0 signal line function value: TC0_TCLK0 */
#define PIO_PA24A_TC0_TCLK0                        _UL_(1 << 24) /**< TC0 signal: TC0_TCLK0 */
#define PIN_PA25A_TC0_TCLK1                        _L_(25)      /**< TC0 signal: TC0_TCLK1 on PA25 mux A */
#define MUX_PA25A_TC0_TCLK1                        _L_(0)       /**< TC0 signal line function value: TC0_TCLK1 */
#define PIO_PA25A_TC0_TCLK1                        _UL_(1 << 25) /**< TC0 signal: TC0_TCLK1 */
#define PIN_PA26A_TC0_TCLK2                        _L_(26)      /**< TC0 signal: TC0_TCLK2 on PA26 mux A */
#define MUX_PA26A_TC0_TCLK2                        _L_(0)       /**< TC0 signal line function value: TC0_TCLK2 */
#define PIO_PA26A_TC0_TCLK2                        _UL_(1 << 26) /**< TC0 signal: TC0_TCLK2 */
#define PIN_PA21A_TC0_TIOA0                        _L_(21)      /**< TC0 signal: TC0_TIOA0 on PA21 mux A */
#define MUX_PA21A_TC0_TIOA0                        _L_(0)       /**< TC0 signal line function value: TC0_TIOA0 */
#define PIO_PA21A_TC0_TIOA0                        _UL_(1 << 21) /**< TC0 signal: TC0_TIOA0 */
#define PIN_PA22A_TC0_TIOA1                        _L_(22)      /**< TC0 signal: TC0_TIOA1 on PA22 mux A */
#define MUX_PA22A_TC0_TIOA1                        _L_(0)       /**< TC0 signal line function value: TC0_TIOA1 */
#define PIO_PA22A_TC0_TIOA1                        _UL_(1 << 22) /**< TC0 signal: TC0_TIOA1 */
#define PIN_PA23A_TC0_TIOA2                        _L_(23)      /**< TC0 signal: TC0_TIOA2 on PA23 mux A */
#define MUX_PA23A_TC0_TIOA2                        _L_(0)       /**< TC0 signal line function value: TC0_TIOA2 */
#define PIO_PA23A_TC0_TIOA2                        _UL_(1 << 23) /**< TC0 signal: TC0_TIOA2 */
#define PIN_PA27A_TC0_TIOB0                        _L_(27)      /**< TC0 signal: TC0_TIOB0 on PA27 mux A */
#define MUX_PA27A_TC0_TIOB0                        _L_(0)       /**< TC0 signal line function value: TC0_TIOB0 */
