Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/pio/sam9x60.h
#define PIO_PA27A_TC0_TIOB0                        _UL_(1 << 27) /**< TC0 signal: TC0_TIOB0 */
#define PIN_PA28A_TC0_TIOB1                        _L_(28)      /**< TC0 signal: TC0_TIOB1 on PA28 mux A */
#define MUX_PA28A_TC0_TIOB1                        _L_(0)       /**< TC0 signal line function value: TC0_TIOB1 */
#define PIO_PA28A_TC0_TIOB1                        _UL_(1 << 28) /**< TC0 signal: TC0_TIOB1 */
#define PIN_PA29A_TC0_TIOB2                        _L_(29)      /**< TC0 signal: TC0_TIOB2 on PA29 mux A */
#define MUX_PA29A_TC0_TIOB2                        _L_(0)       /**< TC0 signal line function value: TC0_TIOB2 */
#define PIO_PA29A_TC0_TIOB2                        _UL_(1 << 29) /**< TC0 signal: TC0_TIOB2 */
/* ========== PIO definition for TC1 peripheral ========== */
#define PIN_PC4C_TC1_TCLK3                         _L_(62)      /**< TC1 signal: TC1_TCLK3 on PC4 mux C */
#define MUX_PC4C_TC1_TCLK3                         _L_(2)       /**< TC1 signal line function value: TC1_TCLK3 */
#define PIO_PC4C_TC1_TCLK3                         _UL_(1 << 30) /**< TC1 signal: TC1_TCLK3 */
#define PIN_PC7C_TC1_TCLK4                         _L_(65)      /**< TC1 signal: TC1_TCLK4 on PC7 mux C */
#define MUX_PC7C_TC1_TCLK4                         _L_(2)       /**< TC1 signal line function value: TC1_TCLK4 */
#define PIO_PC7C_TC1_TCLK4                         _UL_(1 << 1) /**< TC1 signal: TC1_TCLK4 */
#define PIN_PC14C_TC1_TCLK5                        _L_(72)      /**< TC1 signal: TC1_TCLK5 on PC14 mux C */
#define MUX_PC14C_TC1_TCLK5                        _L_(2)       /**< TC1 signal line function value: TC1_TCLK5 */
#define PIO_PC14C_TC1_TCLK5                        _UL_(1 << 8) /**< TC1 signal: TC1_TCLK5 */
#define PIN_PC2C_TC1_TIOA3                         _L_(60)      /**< TC1 signal: TC1_TIOA3 on PC2 mux C */
#define MUX_PC2C_TC1_TIOA3                         _L_(2)       /**< TC1 signal line function value: TC1_TIOA3 */
#define PIO_PC2C_TC1_TIOA3                         _UL_(1 << 28) /**< TC1 signal: TC1_TIOA3 */
#define PIN_PC5C_TC1_TIOA4                         _L_(63)      /**< TC1 signal: TC1_TIOA4 on PC5 mux C */
#define MUX_PC5C_TC1_TIOA4                         _L_(2)       /**< TC1 signal line function value: TC1_TIOA4 */
#define PIO_PC5C_TC1_TIOA4                         _UL_(1 << 31) /**< TC1 signal: TC1_TIOA4 */
#define PIN_PC12C_TC1_TIOA5                        _L_(70)      /**< TC1 signal: TC1_TIOA5 on PC12 mux C */
#define MUX_PC12C_TC1_TIOA5                        _L_(2)       /**< TC1 signal line function value: TC1_TIOA5 */
#define PIO_PC12C_TC1_TIOA5                        _UL_(1 << 6) /**< TC1 signal: TC1_TIOA5 */
#define PIN_PC3C_TC1_TIOB3                         _L_(61)      /**< TC1 signal: TC1_TIOB3 on PC3 mux C */
#define MUX_PC3C_TC1_TIOB3                         _L_(2)       /**< TC1 signal line function value: TC1_TIOB3 */
#define PIO_PC3C_TC1_TIOB3                         _UL_(1 << 29) /**< TC1 signal: TC1_TIOB3 */
#define PIN_PC6C_TC1_TIOB4                         _L_(64)      /**< TC1 signal: TC1_TIOB4 on PC6 mux C */
#define MUX_PC6C_TC1_TIOB4                         _L_(2)       /**< TC1 signal line function value: TC1_TIOB4 */
#define PIO_PC6C_TC1_TIOB4                         _UL_(1 << 0) /**< TC1 signal: TC1_TIOB4 */
#define PIN_PC13C_TC1_TIOB5                        _L_(71)      /**< TC1 signal: TC1_TIOB5 on PC13 mux C */
#define MUX_PC13C_TC1_TIOB5                        _L_(2)       /**< TC1 signal line function value: TC1_TIOB5 */
#define PIO_PC13C_TC1_TIOB5                        _UL_(1 << 7) /**< TC1 signal: TC1_TIOB5 */

#endif /* _SAM9X60_GPIO_H_ */

